[
{"description": ["<p>Lazada is an online shopping center where you can not only buy products but also sell your stuff that you do not need anymore. It offers electronic products like laptops, smartphones</p>", "<p>,wrist watches, blenders and sewing machines; women’s and men’s fashion items like dresses, bags, eye wears, shoes, and jewellery; health products like food supplements, medical supplies, and beauty tools; travelling items like backpacks, suitcases; sports apparel like helmets, shoes, clothing; and many more! You can also look on their <a href=\"http://www.lazada.com.ph/\" target=\"_blank\" rel=\"noopener\">website </a>for more information. Enjoy (online) shopping!</p>", "<p>If you are looking discount rates that will fit your budget, you can check MetroDeal, another online shopping site. It presents discount rates from a trip to the Enchanted Kingdom to meals and sports experience</p>", "<p>at Maximus Athlete’s Shop Café. To those who love to travel, MetroDeal also offers discounted rates for a stay in Sagada, Baguio, and Puerto Princesa. Furthermore, it also has buffet deals at Novotel Manila in Araneta Center, Cubao and at Esteemed Seasons Café at Manila Pavilion for food lovers! These deals indeed validate MetroDeal’s tagline: Live your City for Less!</p>", "<p>Rappler is an online news network that reports about different beats like business, sports, health and lifestyle, technology, and of course, national issues. This year, it had a special coverage on the 2016 National Elections, which includes an article series entitled, <a href=\"http://www.rappler.com/nation/politics/elections/2016/121124-the-imagined-president?utm_source=facebook&amp;amp;utm_medium=referral\" target=\"_blank\" rel=\"noopener\"><em>The Imagined President </em></a>(This series presented in-depth reports about the five presidential candidates), pre- and post-election live reports, and expert interviews regarding election matters.</p>", "<p>Did you experience finally able to buy a new camera but for an expensive price, only to find out that a store is selling the same product… for a cheaper price?! To avoid having this experience again, you can visit Priceprice.com, a price comparison site in the Philippines. Now, you can compare prices of mobile phones, cameras, tablets, and even gadget accessories! Probably, you will be able to look for a gadget at a relatively lower price next time. Just do not forget that a product’s quality is still important!</p>", "<p>Yondu, Incorporated, formerly known as the Entertainment Gateway Group (EGG), is a mobile content provider bought by Globe Telecom in 2008.</p>", "<p>It specializes in mobile advertising, information technology outsourcing, and telecommunications. Also, Yondu, Inc. is now implementing location-based advertising services (LBAS), which locates potential customers based on their phone signals. This helps mobile service providers to easily and efficiently send their promos to their stakeholders.</p>", "<p>When you are looking for an online fashion shop, Zalora is for you. It offers products that will surely fit your fashion sense, from shoes, accessories, and other items for men and women. According to its co-founder and chief executive officer (CEO) Paulo Campos, Zalora also aims to develop e-commerce in the Philippines and <em>“educate them (customers) on the benefits of online shopping, and dress them in the latest fashion trends in the quickest way possible” </em>to improve their online shopping experience.</p>", "<p>I-Remit is a remittance firm founded in 2001. It utilizes the online platform, making the remittance period relatively shorter. Also, it offers <em>IDelivery, </em>a door-to-door remittance mode that covers almost all regions and more than 100 cities and municipalities in the country today; <em>INotify, </em>a nation-wide quick remittance pick-up service; and <em>INotify Foreign, </em>a country-to-country remittance mode.</p>", "<p>Xurpas, which started as a plain telecommunications content provider, has now evolved into a multi-dimensional company that provides gaming, messaging, and enterprising services. Moreover, it aims to distribute to mobile phone subscribers the content and services provided by its client operators.</p>", "<p>So you need to call someone right away because of an emergency but… your unlimited call and text promo just expired. And your friend cannot even send a text because his postpaid plan is currently not working. What will you do? You found an internet café nearby.</p>", "<p>Maybe you can try internet-based messaging! This is what Chikka offers to you: a chance to still communicate with someone on phone without using your own! It is like a combination of Twitter and the Facebook Messenger, but the only difference is it allows you to “text,” although limited to 450 characters only, instead of chat while using the Internet.</p>", "<p>Do you have a passion for teaching AND the English language? If yes, you can turn that passion into an income-generating work in RareJob. It started in 2007, with the goal of teaching the English language to Japanese people. Its first tutors came from the University of the Philippines (UP). As years go by, it was able to broaden its tutorship, which is no longer limited to UP students. In fact, it had already seen an increase in its number of tutors, from 2000 in 2011 to 3000 in 2014.</p>", "<p>Audra is a “rolled-into-one digital publishing platform.” It facilitates publishing of a variety of materials like educational journals, publicity materials, and instructional manuals. Audra allows these readily-available materials to be seen anytime and anywhere. Its developers simply call this as “mobile publishing,” utilizing the current generation of gadgets and the creative minds of people.</p>", "<p>For travellers, Cape is definitely for you! It is a travel application that allows you to buy discounted tickets or what they call as chance passenger tickets. It is now evolving into an application that will, like what the others say, connect the people to the world. This means more travel options worldwide! Now, your world just becomes bigger!</p>", "<p>This Quezon City-based start-up is an audio content provider that helps both the music and advertising industries. It was used to capture only music at first, but its developers, Unyx Sta. Ana and Raymond del Rosario,  realized that it has the potential to even assist in advertisements. Now, Orchestrack is used to monitor audio contents from TV and radio commercials.</p>", "<p>Pickld is a photo diary application. As the name suggests, it allows you to store photos that are significant to you. Using Pickld, you will not just upload some random photos. It employs a storybook format, which means you can arrange your photos in a storyline that will organize your memorable moments in life. Can you imagine now looking at the photos that are most dear to you? Pretty nostalgic, isn’t it?</p>", "<p>Doxcheck verifies the documents that you had read online. It also protects these documents from potential online thieves who will claim your work as theirs. Today, lots of information are being uploaded</p>", "<p>to the Internet that you are now confused which is real and which is fake. Doxcheck can help you in judging the credibility of such information. You don’t want to cite a fake journal in your research, do you? More so, you never want your material—a product of your hard work—to be easily stolen, right?</p>", "<p>This start-up advises you on the potential careers that you can take, which is, of course, backed by the right education. The developers of Edukasyon.ph believe that people can be closer to their desired careers if they will be groomed by the educational institution that fits their preferences. From scholarships and courses to programs and schools, this online advisor can lead you to the right path!</p>", "<p>This start-up aims to help unemployed and underemployed workers. This is for them to maximize the skills that they had learned and at the same time, do the jobs that fit their expertise and competence. Of course, Empleo alone will not solve employment problems in the country overnight. Still, it is good that there are people who want to help in addressing these problems. Your idea might solve other problems in the country today. Better transform it into a start-up now!</p>", "<p>Looking for workplaces just got easier with FlySpaces! With the help of this start-up, you can choose among the best workplaces for you and your co-workers and at the time that is most convenient for all of you. A good</p>", "<p>workplace, its developers believe, is crucial in coming up with the best products. As elaborated on their website, a workplace is not just a location, but <em>“a setting that inspires ideas motivates actions and promotes growth.”</em></p>", "<p>PawnHero is an online pawn shop. Yes, you can sell your items through it, but it still offers more services! One, you will have an estimate of how much you can get from your item as assessed by their experts. Two, you can have your item picked up by them. Three, shipping is FREE! Do you want more? There are no penalties for late payments. And you will receive your money through a PawnHero Card to be given for FREE! PawnHero indeed saves the day!</p>", "<p>This start-up brings you knowledge about privileges and discounts you may not know about when you are transacting in a store. In other words, this helps you to make good deals! Through its application, MobKard, you can now get the best deals in the stores near you with the use of your smartphone. It’s convenient, isn’t it?</p>", "<p>Studying these (boring?) subjects just get exciting!</p>", "<p> </p>", "<p>It is said on its official website that the Philippines is one of the top rice importers despite being agricultural in general. It, therefore, aims to help farmers in the country, particularly in their financial matters. Aside from that, it also helps donors reap their own rewards through a net profit sharing scheme. As a proof of its credibility as a social enterprise, it is funded by institutions here in the Philippines, in Malaysia, Netherlands, as well as in the United States. Join Cropital now and you will not only make your money grow,  but the lives of our beloved farmers as well.</p>", "<p>If there is one start-up that is a firm believer of the saying, <em>“Time is gold,” </em>it is TimeFree Innovations. Basically, it maximizes cloud and other mobile services in order for you to save your time. <em>TimeFree </em>also has applications that offer extensive analytics reports to help you in your decision-making. It also has a proxy-like application so someone, or something rather, will wait in line for you in stores or in events while you’re still on the way.</p>", "<p>This start-up helps in maximizing the farmer products like rice, corn, and other grains by employing a system that improves the growth of these farm produce. Specifically, it monitors their moisture content and the temperature that the farm produce are under. In other words, iHarvest+ is dedicated in bringing you high-quality farm products that had undergone trusted processes.</p>", "<p><em>Banwa’</em>s main goal is to help the survivors of Typhoon Haiyan, specifically the women weavers, their families, and their communities, to be empowered by providing them livelihoods. This empowerment initiative ultimately wants to instill sustainable income- generating schemes to its beneficiaries.</p>", "<p>Moreover, <em>Banwa </em>also aims to preserve the culture of <em>banig </em>making by engaging the youth and by pitching it to larger markets.</p>", "<p>Paulo del Puerto, one of Pocketmarket’s founders, noticed that entrepreneurs tend to use multiple platforms in dealing with customers, making it hard for them to finish transactions efficiently. Enter Pocketmarket in the equation. It helps entrepreneurs promote their products and services in different social networking sites and centralizes the transactions in instant messaging. Now, customers no longer need to look for contact details when they see a product. They will be redirected to the product page through Pocketmarket and make the transaction there. Talking about efficiency. *thumb up*</p>", "<p>According to its official website, Qwikwire focuses its services in three aspects: management, report generation, and secure of payments. In particular, it facilitates appropriate billing systems for real estate developers, business process outsourcing (BPO) agencies, and banks. For further security of transactions, it uses a 256-bit secure sockets layer for data transmissions and tokens for confidential financial information.</p>", "<p>This start-up is focused on designing and producing mobility solutions. Its current product is a foldable bicycle, which is more convenient than the ordinary bikes and even the other foldable bikes because it is easy to carry. It also durable, saving you a lot of money should you decide to buy one.</p>", "<p>The idea of the Nyfti bicycle arose from traffic, according to Nyfti, Inc. chief executive officer Carl Mamawal. He said he switched to bikes when he could no longer bear the everyday traffic. However, he thought of the kind of bike that will be the most convenient. The rest, like the others say, is history.</p>", "<p>For aspiring accountants, this start-up is for you. ICPA is another online academic reviewer, which provides tests that will help you ace the accountancy subject. It allows you to customize your tests—you can pick your lessons and the difficulty of the</p>", "<p>questions. More than that, you can also combine different sets of questions. After taking the tests, you will be taught new ways on how to answer questions and will also inform you of some of your misconceptions. Furthermore, you will be able to know how you are faring with those tests that you yourself have made, giving you an idea where you already are in the said subject.</p>", "<p>Are you having the trouble of bringing a bulky wallet full of loyalty and other reward cards? Well, those days will soon be gone! PerxClub puts the cards of almost 100 premier brands on your phone. You also do not have to worry where it will be accepted because PerxClub is available in more than 600 locations all over the Philippines. All you need to do is a free one-time registration and your struggles of carrying a wallet full of cards are now over!</p>", "<p>199Jobs connects buyers and sellers for them to work well together. Its main goals are to help people hire freelancers for some quick and easy jobs so you can focus on your other important tasks more. Likewise, it basically helps those freelancers earn some income for themselves. A win-win situation for both sides!</p>", "<p>This allows doctors and other medical practitioners to input data of patients and share them with their colleagues, facilitating referrals, studies, and other medical ventures. Caresharing also promotes collaboration among medical practitioners because they get to access the same sets of data, and as a result, further improve studies about medicine.</p>", "<p>Using your smartphone, Uber basically gives you a vehicle you can ride on. When the car finally comes, the driver already knows where you’re heading to. Uber also lets you decide on the mode of payment. There’s no need to worry if you have cash or a card. Uber accepts either of the two! More than that, it prioritizes your safety, proven by its continuous pursuit of technologies to develop itself. Uber also allows you to give your feedback on the driver and on your ride for them to improve passengers’ experience.</p>", "<p>Lenddo, which was founded in 2011, initially provided microloans to the middle class in developing countries. As years went by, it has evolved into a company that lets its customers use their social media accounts like Facebook, Twitter, LinkedIn, and Google to increase their credit worthwhile being supported by financial institutions. This will mean higher chances for people to land jobs, access strict online shopping sites, and apply for loans.</p>", "<p>Are you a fresh graduate looking for a job or a former employee looking for greener pastures? Look no more! Kalibrr has your back! It is a startup focused on matching you to the right job where you can really apply the skills that you had learned in the past. This is how it works in Kalibrr: It will assess your skills so you will be recommended for the right jobs. However, if you still lack the necessary skills, you will be trained. For employers, Kalibrr will help in finding the right people for their tasks! And for you, you will now be more than ready to take those jobs that will improve your living!</p>", "<p>It describes itself as a “job bulletin board” operating in the internet platform. Based in Cebu, this start-up aims to help job seekers and recruiters at the same time. Since its establishment in 2007, it was able to meet the standards and needs of both big, international corporations as well as small-time, local businesses. As a proof of its credibility, it was recognized by Convergys–a known BPO in the country—for its “exemplary service” back in 2008.</p>", "<p>Everyone needs a home, and MyProperty.ph recognizes that. It is a start-up that focuses on giving you your desired property. It has a search engine where you can look for a house and/or a property based on your preferences. Furthermore, it provides the latest information about these properties so that you can choose what’s the best for you!</p>", "<p>Cybertech is dedicated in giving both industries and its customers the best experience by employing cost-benefit analyses, audience analyses, and other strategies. It is known for having strong working relationships with different organizations across the globe and has been using innovative technologies that allow them to implement extensive outsourcing schemes.</p>", "<p>This start-up was established to “revolutionize Philippine travel.” Big words, right? Tripmoba has a combination of services that include instant reservation of flights in and out the Philippines, hotel bookings, ticketing, and travel packages. All of these are in line with the main goal of Tripmoba: to build a “community” of travelers bound by stories, experiences, and memorable moments that they can easily share with the others. This goal also aims to inspire people to travel and make memories with their loved ones and at the same time, explore the wonders of a country blessed with nature’s best.</p>", "<p>Starting the second half of our list is 98Labs. Its main services include business promotions and partnerships, and software developments. 98Labs is composed of experienced programmers who utilize different programming languages like Java and .NET, giving you “well-instructed” computers and software. It also uses online-based mechanisms like the social media and internet marketing to help your business cover a wider reach and make your presence felt in the business industry.</p>", "<p>Cogito is another SAAS platform that turns manually made processes into automated workflows and uploads them in cloud services for backup and storage. It was born out of the difficulty of its creators in finding well-versed developers who will make the initial codes for the apps they will make. This will ease the burden for senior developers and the transition for junior creators who are new to their field. In other words, Cogito is your partner-slash-assistant in app development!</p>", "<p>Acasa provides an online workplace that will allow you to work and collaborate with professionals around the world. Because it is online-based, Acasa keeps you from going through pollution, traffic, and other forms of headache before you even reach your workplace. Now, you can be more productive because you can dedicate enough efforts to your work. You don’t need to worry about these factors that drain your energy for two to three hours a day. What a relief!</p>", "<p> </p>", "<p>Codetoki is a job-matching startup. Together with its partner companies, they issue different forms of challenges to job hunters in order for them to express their interest in working for those companies. Challenges can be tests or games, which will catch the attention of game-dedicated individuals who also want to earn a living. After completing these challenges, you will earn badges that will make you visible to employers. By being visible to your potential employers, you do not need to worry much about your job hunting!</p>", "<p>Ship-Track-Deliver-Feedback. In a nutshell, this is how CrowdToGo works. By combining the ideas of professionals from the business, research, and software development sectors, CrowdToGo was able to develop a proprietary algorithm. This deploys delivery persons to strategic places where they can be most utilized. It then selects the most convenient and efficient delivery person, or what they call as “crowdie,” speeding up not only the delivery time for customers but also the revenue generation for businesses  because their products reach their buyers immediately.</p>", "<p>This startup connects local government units (LGUs) to its constituents by publishing relevant information for them and by providing analytics monitoring their service performance. CSP.ph also serves the ordinary people by being a platform where they can report any matters that need to be addressed by their LGUs.</p>", "<p>Are you a fan of the <em>Amazing Race </em>or the <em>Survivor Series? </em>If so, Cyburban is for you. This is an adventure race organizer that increases participation among possible players and decreases the time and money to spend people who will “staff the race,” as said by its founder, Ari Bancale. The rules and game instructions are now encoded in the smarthphones of the players. This app-based race organizer can possibly change how TV series like the <em>Amazing Race </em>or the <em>Survivor </em>are organized. Are you ready? Are your smartphones ready?</p>", "<p>For environment and natural resource advocates, this one’s for you. In partnership with the Department of Science and Technology, Krayno aims to develop eco- friendly innovations where development initiatives will be in lined. These innovations will address the issue regarding building infrastructures at the expense of the environment. You still want your children to see REAL trees, don’t you?</p>", "<p>Do you encounter problems regarding your transportation-based business? Fret no more! You can lean on LeanAsset, a GPS fleet management system. It can be used to track the location and movements of all the vehicles that you use to your business. This will address security issues because you can monitor your assets from your office. It can also help you balance your use of those assets, utilizing them and at the same time, avoid overusing them.</p>", "<p><img loading=\"lazy\" width=\"782\" height=\"296\" class=\"wp-image-664\" src=\"https://entreplounge.com/wp-content/uploads/2017/05/word-image-64.jpeg\" srcset=\"https://entreplounge.com/wp-content/uploads/2017/05/word-image-64.jpeg 782w, https://entreplounge.com/wp-content/uploads/2017/05/word-image-64-300x114.jpeg 300w, https://entreplounge.com/wp-content/uploads/2017/05/word-image-64-768x291.jpeg 768w, https://entreplounge.com/wp-content/uploads/2017/05/word-image-64-100x38.jpeg 100w\" sizes=\"(max-width: 782px) 100vw, 782px\"> Are you a party-goer? Do you love coming to parties and other events and socialize with other people? Then Partyphile is for you. It will not only inform you of events but also of the best bars and clubs around! And what’s the use of knowing there will be a party but you cannot come? Partyphile will help you in reserving for slots so you will not miss having the night of your life!</p>", "<p>Tripid is a ride-sharing app that aims to lessen the travel expenses of travellers. It connects travellers to drivers who will take on the same direction as theirs. There’s no need to wait for PUV’s that have no space for you (aww). Tripid will deliver you to the right <s>person </s>vehicle.</p>", "<p>It utilizes the power of SMS text and voice calls to send information that needs immediate attention from its receivers. Information about the weather or any emergency situations can be delivered right away. It also allows you to automatically send messages at a later time. No need to worry about forgetting to send messages intended for future purposes. You can also conduct surveys and launch campaigns through <a href=\"https://www.engagespark.com/\" target=\"_blank\" rel=\"noopener\">EngageSPARK</a>. Moreover, its Interactive Voice Response (IVR) feature gives users an access to relevant information by using their voice. This means they do not have to mind their grammar or spelling!</p>", "<p>It informs you of the services and other freelancers that are near your current location. This should help you in carrying out tasks immediately without having to look somewhere else. For your safety, it also informs you of local emergency numbers like the ambulance and the police contacts.</p>", "<p>If you don’t want to regret buying a house of a property that cost you a large amount of money, you can seek the help of ZipMatch in this matter. It is an online real estate marketplace that aims to empower buyers by providing them relevant information about their potential properties and by also assisting them in the transactions that they still have to go through. ZipMatch was the result of the combined ideas of entrepreneur John Dang and real estate broker Chow Paredes, who both recognize that difficulties that home buyers here in the Philippines face.</p>", "<p>Radiologists are hard to find despite the critical role that they play in medical processes. For the record, radiologists are those experts in photo documenting and interpreting the internal parts of a person’s body, allowing both the patient and his/her doctor to see what is (wrong) inside of him/her. Lifetrack Medical Systems connects patients to experienced radiologists to help them assess medical images and immediately report to other doctors if necessary.</p>", "<p><em>Order Now. We Deliver. </em>That is the tag line of HomeDiner. It helps you in ordering food from different restaurants. It also helps your orders be delivered at your current location, especially if you just want to enjoy the view of your place. Furthermore, HomeDiner allows you to cancel orders if you suddenly have a change of mind (or heart).</p>", "<p>Do you have a memorable (or embarrassing) moment that you want to share? Then, there is a platform that allows you to document such moments. Introducing Tripsiders. Launched five years ago, Tripsiders has now built a community of travelers who share their experiences with the others. Here, you can get inspired by other people’s stories or be informed by reading travel tips and insider information about the places you want to go to.</p>", "<p>You and your friends have that moment when you really don’t know what and where to eat.</p>", "<p>Fortunately, there’s FoodEagle available for you all. It has an image section that shows you photos of food that will make you crave. It also tells you of the restaurants nearby. You won’t go hungry with FoodEagle!</p>", "<p>Galleon.ph presents products outside the Philippines, giving you a different shopping experience. Paying will not be a problem because it gives different paying options. Rest assured that the amount you will pay for includes everything, from the price of the product to the shipping fee.</p>", "<p>DragonPay is an alternative paying gateway built for people in developing countries. It allows customers to buy online and pay via automated teller machines (ATMs) and online banking services. You can also pay directly at banks or at the retailers themselves.</p>", "<p>Lifebit is an online diary—best for people who like to share their lives with the others. However, this is different from blogs or other social networking sites like Facebook, Twitter, and Tumblr. It is actually a game! You will get badges for every moment of your life that you post, making your Lifebit experience more fun and exciting!</p>", "<p>AVA is an online marketplace featuring the brands that you surely love! It has La Mer watches, wallets from Dynomighty, jewelry from Natalya Lagdameo, foldable sunglasses from Sunpocket, and hand-crafted jewelry from Panopio. Do you want more? What about gift items from Balvi, office supplies from Lexon, shoes from Bensimon, jeans from Monkee Genes, and exclusive AVA brands Janus and Pollock. It also offers sales so you can buy their products at cheaper prices! You just have to be quick because these sales only run for a few days.</p>", "<p>Technology has been booming in the recent years and GSMetrix is taking advantage. This startup focuses on research and development in the context of engineering. It has already supported public and private sectors in developing technologies on weather monitoring, fleet management, and data acquisition. Validating their claim as one of the best in the industry are their Technology Company of the Year award in 2010, Best Technology Award (by Global TIC in Taiwan), and its nomination to the Asian Innovation Awards in 2011.</p>", "<p>Salarium is another SAAS aimed to serve both small-time and large-scale businesses. Its main service is providing payroll systems, keeping in track time and attendance of employees, salary disbursement, and tax calculations.</p>", "<p>Salarium-based payroll systems are easy to use. You do not need to be hardcore cloud experts. They are also customizable and can adapt to other similar softwares, making data importation and exportation easier.</p>", "<p>Furthermore, the security of those payroll systems are follows Philippine, US, and European Union standards. You’re now sure that your data will not be easily stolen by online thieves!</p>", "<p>program by referring you to its partner call centers; reimbursing your transportation expenses; and allowing you to <em>“study now [then] pay later!”</em></p>", "<p>This is a research assistance tool that helps you understand legal concepts easily. Because it is cloud-based, you can access all of its features using any device. It also provides you customizable legal and business forms so you don’t have to worry on formatting letters anymore.</p>", "<p>Pouch is promoting smart wristbands in place of tickets in order to enter big events. These wristbands do not just act like tickets to enter an event; they can also be used to pay for your food, drinks, and merchandizes! It goes to show that Pouch really wants you to experience memorable and hassle-free moments!</p>", "<p>It offers customer service and back-office support to companies looking for outsourcing providers that cover a global scale. Its back-office support services include content moderation, audio and video transcription, data input and analytics, and online research. Meanwhile, its customer services include upselling programs, welcome calls, omnichannel support, and inbound and outbound support.</p>", "<p>As its name suggests, LoanSolutions aims to address the lending industry in the country by providing the best lending rates available. So far, you can apply for a personal, OFW, vehicle, and business loans. You are sure that you will really have your loans because LoanSolutions supported by BDO, Metrobank, and Sterling Bank of Asia, to name a few. In general, it wants to empower people in order for them to make better financial decisions in life!</p>", "<p>meanwhile, allows your team to update your target customers of your latest products and services despite having no internet connection. This implies that your business can widen its reach and improve its rapport with other people.</p>", "<p>As a business head or manager, you have to if your employees are getting their jobs done. With Tarkie, you will be able to track all your employees at once without having to wish to divide your body! You will also be able to monitor their progress in their assignments so you don’t need to wait for them to report. Furthermore, you will quickly know who’s leading and who’s getting behind, notifying you if you need to intervene already or just let the employee handle the job by herself/himself. In other words, Tarkie will help you in ensuring efficiency and productivity in your workplace!</p>", "<p>middle and lower classes to be literate in relatively complicated financial transactions, helping them in improving their lives eventually. Specifically, the services of Ayannah are mobile- and social media- based, veering away from the processes of traditional banks.</p>", "<p>Galileo creates the smartphone app, PARAK—a police accident report kit. You do not need to wait for the police or the media to report an accident because the PARAK app can be used as a platform for such reports. In fact, the Land Transportation Franchising and Regulatory Board had already plans to use Galileo Software’s app to aid the Highway Patrol Group in their every day duties.</p>", "<p> </p>"]}
][
{"description": ["<p>Lazada is an online shopping center where you can not only buy products but also sell your stuff that you do not need anymore. It offers electronic products like laptops, smartphones</p>", "<p>,wrist watches, blenders and sewing machines; women’s and men’s fashion items like dresses, bags, eye wears, shoes, and jewellery; health products like food supplements, medical supplies, and beauty tools; travelling items like backpacks, suitcases; sports apparel like helmets, shoes, clothing; and many more! You can also look on their <a href=\"http://www.lazada.com.ph/\" target=\"_blank\" rel=\"noopener\">website </a>for more information. Enjoy (online) shopping!</p>", "<p>If you are looking discount rates that will fit your budget, you can check MetroDeal, another online shopping site. It presents discount rates from a trip to the Enchanted Kingdom to meals and sports experience</p>", "<p>at Maximus Athlete’s Shop Café. To those who love to travel, MetroDeal also offers discounted rates for a stay in Sagada, Baguio, and Puerto Princesa. Furthermore, it also has buffet deals at Novotel Manila in Araneta Center, Cubao and at Esteemed Seasons Café at Manila Pavilion for food lovers! These deals indeed validate MetroDeal’s tagline: Live your City for Less!</p>", "<p>Rappler is an online news network that reports about different beats like business, sports, health and lifestyle, technology, and of course, national issues. This year, it had a special coverage on the 2016 National Elections, which includes an article series entitled, <a href=\"http://www.rappler.com/nation/politics/elections/2016/121124-the-imagined-president?utm_source=facebook&amp;amp;utm_medium=referral\" target=\"_blank\" rel=\"noopener\"><em>The Imagined President </em></a>(This series presented in-depth reports about the five presidential candidates), pre- and post-election live reports, and expert interviews regarding election matters.</p>", "<p>Did you experience finally able to buy a new camera but for an expensive price, only to find out that a store is selling the same product… for a cheaper price?! To avoid having this experience again, you can visit Priceprice.com, a price comparison site in the Philippines. Now, you can compare prices of mobile phones, cameras, tablets, and even gadget accessories! Probably, you will be able to look for a gadget at a relatively lower price next time. Just do not forget that a product’s quality is still important!</p>", "<p>Yondu, Incorporated, formerly known as the Entertainment Gateway Group (EGG), is a mobile content provider bought by Globe Telecom in 2008.</p>", "<p>It specializes in mobile advertising, information technology outsourcing, and telecommunications. Also, Yondu, Inc. is now implementing location-based advertising services (LBAS), which locates potential customers based on their phone signals. This helps mobile service providers to easily and efficiently send their promos to their stakeholders.</p>", "<p>When you are looking for an online fashion shop, Zalora is for you. It offers products that will surely fit your fashion sense, from shoes, accessories, and other items for men and women. According to its co-founder and chief executive officer (CEO) Paulo Campos, Zalora also aims to develop e-commerce in the Philippines and <em>“educate them (customers) on the benefits of online shopping, and dress them in the latest fashion trends in the quickest way possible” </em>to improve their online shopping experience.</p>", "<p>I-Remit is a remittance firm founded in 2001. It utilizes the online platform, making the remittance period relatively shorter. Also, it offers <em>IDelivery, </em>a door-to-door remittance mode that covers almost all regions and more than 100 cities and municipalities in the country today; <em>INotify, </em>a nation-wide quick remittance pick-up service; and <em>INotify Foreign, </em>a country-to-country remittance mode.</p>", "<p>Xurpas, which started as a plain telecommunications content provider, has now evolved into a multi-dimensional company that provides gaming, messaging, and enterprising services. Moreover, it aims to distribute to mobile phone subscribers the content and services provided by its client operators.</p>", "<p>So you need to call someone right away because of an emergency but… your unlimited call and text promo just expired. And your friend cannot even send a text because his postpaid plan is currently not working. What will you do? You found an internet café nearby.</p>", "<p>Maybe you can try internet-based messaging! This is what Chikka offers to you: a chance to still communicate with someone on phone without using your own! It is like a combination of Twitter and the Facebook Messenger, but the only difference is it allows you to “text,” although limited to 450 characters only, instead of chat while using the Internet.</p>", "<p>Do you have a passion for teaching AND the English language? If yes, you can turn that passion into an income-generating work in RareJob. It started in 2007, with the goal of teaching the English language to Japanese people. Its first tutors came from the University of the Philippines (UP). As years go by, it was able to broaden its tutorship, which is no longer limited to UP students. In fact, it had already seen an increase in its number of tutors, from 2000 in 2011 to 3000 in 2014.</p>", "<p>Audra is a “rolled-into-one digital publishing platform.” It facilitates publishing of a variety of materials like educational journals, publicity materials, and instructional manuals. Audra allows these readily-available materials to be seen anytime and anywhere. Its developers simply call this as “mobile publishing,” utilizing the current generation of gadgets and the creative minds of people.</p>", "<p>For travellers, Cape is definitely for you! It is a travel application that allows you to buy discounted tickets or what they call as chance passenger tickets. It is now evolving into an application that will, like what the others say, connect the people to the world. This means more travel options worldwide! Now, your world just becomes bigger!</p>", "<p>This Quezon City-based start-up is an audio content provider that helps both the music and advertising industries. It was used to capture only music at first, but its developers, Unyx Sta. Ana and Raymond del Rosario,  realized that it has the potential to even assist in advertisements. Now, Orchestrack is used to monitor audio contents from TV and radio commercials.</p>", "<p>Pickld is a photo diary application. As the name suggests, it allows you to store photos that are significant to you. Using Pickld, you will not just upload some random photos. It employs a storybook format, which means you can arrange your photos in a storyline that will organize your memorable moments in life. Can you imagine now looking at the photos that are most dear to you? Pretty nostalgic, isn’t it?</p>", "<p>Doxcheck verifies the documents that you had read online. It also protects these documents from potential online thieves who will claim your work as theirs. Today, lots of information are being uploaded</p>", "<p>to the Internet that you are now confused which is real and which is fake. Doxcheck can help you in judging the credibility of such information. You don’t want to cite a fake journal in your research, do you? More so, you never want your material—a product of your hard work—to be easily stolen, right?</p>", "<p>This start-up advises you on the potential careers that you can take, which is, of course, backed by the right education. The developers of Edukasyon.ph believe that people can be closer to their desired careers if they will be groomed by the educational institution that fits their preferences. From scholarships and courses to programs and schools, this online advisor can lead you to the right path!</p>", "<p>This start-up aims to help unemployed and underemployed workers. This is for them to maximize the skills that they had learned and at the same time, do the jobs that fit their expertise and competence. Of course, Empleo alone will not solve employment problems in the country overnight. Still, it is good that there are people who want to help in addressing these problems. Your idea might solve other problems in the country today. Better transform it into a start-up now!</p>", "<p>Looking for workplaces just got easier with FlySpaces! With the help of this start-up, you can choose among the best workplaces for you and your co-workers and at the time that is most convenient for all of you. A good</p>", "<p>workplace, its developers believe, is crucial in coming up with the best products. As elaborated on their website, a workplace is not just a location, but <em>“a setting that inspires ideas motivates actions and promotes growth.”</em></p>", "<p>PawnHero is an online pawn shop. Yes, you can sell your items through it, but it still offers more services! One, you will have an estimate of how much you can get from your item as assessed by their experts. Two, you can have your item picked up by them. Three, shipping is FREE! Do you want more? There are no penalties for late payments. And you will receive your money through a PawnHero Card to be given for FREE! PawnHero indeed saves the day!</p>", "<p>This start-up brings you knowledge about privileges and discounts you may not know about when you are transacting in a store. In other words, this helps you to make good deals! Through its application, MobKard, you can now get the best deals in the stores near you with the use of your smartphone. It’s convenient, isn’t it?</p>", "<p>Studying these (boring?) subjects just get exciting!</p>", "<p> </p>", "<p>It is said on its official website that the Philippines is one of the top rice importers despite being agricultural in general. It, therefore, aims to help farmers in the country, particularly in their financial matters. Aside from that, it also helps donors reap their own rewards through a net profit sharing scheme. As a proof of its credibility as a social enterprise, it is funded by institutions here in the Philippines, in Malaysia, Netherlands, as well as in the United States. Join Cropital now and you will not only make your money grow,  but the lives of our beloved farmers as well.</p>", "<p>If there is one start-up that is a firm believer of the saying, <em>“Time is gold,” </em>it is TimeFree Innovations. Basically, it maximizes cloud and other mobile services in order for you to save your time. <em>TimeFree </em>also has applications that offer extensive analytics reports to help you in your decision-making. It also has a proxy-like application so someone, or something rather, will wait in line for you in stores or in events while you’re still on the way.</p>", "<p>This start-up helps in maximizing the farmer products like rice, corn, and other grains by employing a system that improves the growth of these farm produce. Specifically, it monitors their moisture content and the temperature that the farm produce are under. In other words, iHarvest+ is dedicated in bringing you high-quality farm products that had undergone trusted processes.</p>", "<p><em>Banwa’</em>s main goal is to help the survivors of Typhoon Haiyan, specifically the women weavers, their families, and their communities, to be empowered by providing them livelihoods. This empowerment initiative ultimately wants to instill sustainable income- generating schemes to its beneficiaries.</p>", "<p>Moreover, <em>Banwa </em>also aims to preserve the culture of <em>banig </em>making by engaging the youth and by pitching it to larger markets.</p>", "<p>Paulo del Puerto, one of Pocketmarket’s founders, noticed that entrepreneurs tend to use multiple platforms in dealing with customers, making it hard for them to finish transactions efficiently. Enter Pocketmarket in the equation. It helps entrepreneurs promote their products and services in different social networking sites and centralizes the transactions in instant messaging. Now, customers no longer need to look for contact details when they see a product. They will be redirected to the product page through Pocketmarket and make the transaction there. Talking about efficiency. *thumb up*</p>", "<p>According to its official website, Qwikwire focuses its services in three aspects: management, report generation, and secure of payments. In particular, it facilitates appropriate billing systems for real estate developers, business process outsourcing (BPO) agencies, and banks. For further security of transactions, it uses a 256-bit secure sockets layer for data transmissions and tokens for confidential financial information.</p>", "<p>This start-up is focused on designing and producing mobility solutions. Its current product is a foldable bicycle, which is more convenient than the ordinary bikes and even the other foldable bikes because it is easy to carry. It also durable, saving you a lot of money should you decide to buy one.</p>", "<p>The idea of the Nyfti bicycle arose from traffic, according to Nyfti, Inc. chief executive officer Carl Mamawal. He said he switched to bikes when he could no longer bear the everyday traffic. However, he thought of the kind of bike that will be the most convenient. The rest, like the others say, is history.</p>", "<p>For aspiring accountants, this start-up is for you. ICPA is another online academic reviewer, which provides tests that will help you ace the accountancy subject. It allows you to customize your tests—you can pick your lessons and the difficulty of the</p>", "<p>questions. More than that, you can also combine different sets of questions. After taking the tests, you will be taught new ways on how to answer questions and will also inform you of some of your misconceptions. Furthermore, you will be able to know how you are faring with those tests that you yourself have made, giving you an idea where you already are in the said subject.</p>", "<p>Are you having the trouble of bringing a bulky wallet full of loyalty and other reward cards? Well, those days will soon be gone! PerxClub puts the cards of almost 100 premier brands on your phone. You also do not have to worry where it will be accepted because PerxClub is available in more than 600 locations all over the Philippines. All you need to do is a free one-time registration and your struggles of carrying a wallet full of cards are now over!</p>", "<p>199Jobs connects buyers and sellers for them to work well together. Its main goals are to help people hire freelancers for some quick and easy jobs so you can focus on your other important tasks more. Likewise, it basically helps those freelancers earn some income for themselves. A win-win situation for both sides!</p>", "<p>This allows doctors and other medical practitioners to input data of patients and share them with their colleagues, facilitating referrals, studies, and other medical ventures. Caresharing also promotes collaboration among medical practitioners because they get to access the same sets of data, and as a result, further improve studies about medicine.</p>", "<p>Using your smartphone, Uber basically gives you a vehicle you can ride on. When the car finally comes, the driver already knows where you’re heading to. Uber also lets you decide on the mode of payment. There’s no need to worry if you have cash or a card. Uber accepts either of the two! More than that, it prioritizes your safety, proven by its continuous pursuit of technologies to develop itself. Uber also allows you to give your feedback on the driver and on your ride for them to improve passengers’ experience.</p>", "<p>Lenddo, which was founded in 2011, initially provided microloans to the middle class in developing countries. As years went by, it has evolved into a company that lets its customers use their social media accounts like Facebook, Twitter, LinkedIn, and Google to increase their credit worthwhile being supported by financial institutions. This will mean higher chances for people to land jobs, access strict online shopping sites, and apply for loans.</p>", "<p>Are you a fresh graduate looking for a job or a former employee looking for greener pastures? Look no more! Kalibrr has your back! It is a startup focused on matching you to the right job where you can really apply the skills that you had learned in the past. This is how it works in Kalibrr: It will assess your skills so you will be recommended for the right jobs. However, if you still lack the necessary skills, you will be trained. For employers, Kalibrr will help in finding the right people for their tasks! And for you, you will now be more than ready to take those jobs that will improve your living!</p>", "<p>It describes itself as a “job bulletin board” operating in the internet platform. Based in Cebu, this start-up aims to help job seekers and recruiters at the same time. Since its establishment in 2007, it was able to meet the standards and needs of both big, international corporations as well as small-time, local businesses. As a proof of its credibility, it was recognized by Convergys–a known BPO in the country—for its “exemplary service” back in 2008.</p>", "<p>Everyone needs a home, and MyProperty.ph recognizes that. It is a start-up that focuses on giving you your desired property. It has a search engine where you can look for a house and/or a property based on your preferences. Furthermore, it provides the latest information about these properties so that you can choose what’s the best for you!</p>", "<p>Cybertech is dedicated in giving both industries and its customers the best experience by employing cost-benefit analyses, audience analyses, and other strategies. It is known for having strong working relationships with different organizations across the globe and has been using innovative technologies that allow them to implement extensive outsourcing schemes.</p>", "<p>This start-up was established to “revolutionize Philippine travel.” Big words, right? Tripmoba has a combination of services that include instant reservation of flights in and out the Philippines, hotel bookings, ticketing, and travel packages. All of these are in line with the main goal of Tripmoba: to build a “community” of travelers bound by stories, experiences, and memorable moments that they can easily share with the others. This goal also aims to inspire people to travel and make memories with their loved ones and at the same time, explore the wonders of a country blessed with nature’s best.</p>", "<p>Starting the second half of our list is 98Labs. Its main services include business promotions and partnerships, and software developments. 98Labs is composed of experienced programmers who utilize different programming languages like Java and .NET, giving you “well-instructed” computers and software. It also uses online-based mechanisms like the social media and internet marketing to help your business cover a wider reach and make your presence felt in the business industry.</p>", "<p>Cogito is another SAAS platform that turns manually made processes into automated workflows and uploads them in cloud services for backup and storage. It was born out of the difficulty of its creators in finding well-versed developers who will make the initial codes for the apps they will make. This will ease the burden for senior developers and the transition for junior creators who are new to their field. In other words, Cogito is your partner-slash-assistant in app development!</p>", "<p>Acasa provides an online workplace that will allow you to work and collaborate with professionals around the world. Because it is online-based, Acasa keeps you from going through pollution, traffic, and other forms of headache before you even reach your workplace. Now, you can be more productive because you can dedicate enough efforts to your work. You don’t need to worry about these factors that drain your energy for two to three hours a day. What a relief!</p>", "<p> </p>", "<p>Codetoki is a job-matching startup. Together with its partner companies, they issue different forms of challenges to job hunters in order for them to express their interest in working for those companies. Challenges can be tests or games, which will catch the attention of game-dedicated individuals who also want to earn a living. After completing these challenges, you will earn badges that will make you visible to employers. By being visible to your potential employers, you do not need to worry much about your job hunting!</p>", "<p>Ship-Track-Deliver-Feedback. In a nutshell, this is how CrowdToGo works. By combining the ideas of professionals from the business, research, and software development sectors, CrowdToGo was able to develop a proprietary algorithm. This deploys delivery persons to strategic places where they can be most utilized. It then selects the most convenient and efficient delivery person, or what they call as “crowdie,” speeding up not only the delivery time for customers but also the revenue generation for businesses  because their products reach their buyers immediately.</p>", "<p>This startup connects local government units (LGUs) to its constituents by publishing relevant information for them and by providing analytics monitoring their service performance. CSP.ph also serves the ordinary people by being a platform where they can report any matters that need to be addressed by their LGUs.</p>", "<p>Are you a fan of the <em>Amazing Race </em>or the <em>Survivor Series? </em>If so, Cyburban is for you. This is an adventure race organizer that increases participation among possible players and decreases the time and money to spend people who will “staff the race,” as said by its founder, Ari Bancale. The rules and game instructions are now encoded in the smarthphones of the players. This app-based race organizer can possibly change how TV series like the <em>Amazing Race </em>or the <em>Survivor </em>are organized. Are you ready? Are your smartphones ready?</p>", "<p>For environment and natural resource advocates, this one’s for you. In partnership with the Department of Science and Technology, Krayno aims to develop eco- friendly innovations where development initiatives will be in lined. These innovations will address the issue regarding building infrastructures at the expense of the environment. You still want your children to see REAL trees, don’t you?</p>", "<p>Do you encounter problems regarding your transportation-based business? Fret no more! You can lean on LeanAsset, a GPS fleet management system. It can be used to track the location and movements of all the vehicles that you use to your business. This will address security issues because you can monitor your assets from your office. It can also help you balance your use of those assets, utilizing them and at the same time, avoid overusing them.</p>", "<p><img loading=\"lazy\" width=\"782\" height=\"296\" class=\"wp-image-664\" src=\"https://entreplounge.com/wp-content/uploads/2017/05/word-image-64.jpeg\" srcset=\"https://entreplounge.com/wp-content/uploads/2017/05/word-image-64.jpeg 782w, https://entreplounge.com/wp-content/uploads/2017/05/word-image-64-300x114.jpeg 300w, https://entreplounge.com/wp-content/uploads/2017/05/word-image-64-768x291.jpeg 768w, https://entreplounge.com/wp-content/uploads/2017/05/word-image-64-100x38.jpeg 100w\" sizes=\"(max-width: 782px) 100vw, 782px\"> Are you a party-goer? Do you love coming to parties and other events and socialize with other people? Then Partyphile is for you. It will not only inform you of events but also of the best bars and clubs around! And what’s the use of knowing there will be a party but you cannot come? Partyphile will help you in reserving for slots so you will not miss having the night of your life!</p>", "<p>Tripid is a ride-sharing app that aims to lessen the travel expenses of travellers. It connects travellers to drivers who will take on the same direction as theirs. There’s no need to wait for PUV’s that have no space for you (aww). Tripid will deliver you to the right <s>person </s>vehicle.</p>", "<p>It utilizes the power of SMS text and voice calls to send information that needs immediate attention from its receivers. Information about the weather or any emergency situations can be delivered right away. It also allows you to automatically send messages at a later time. No need to worry about forgetting to send messages intended for future purposes. You can also conduct surveys and launch campaigns through <a href=\"https://www.engagespark.com/\" target=\"_blank\" rel=\"noopener\">EngageSPARK</a>. Moreover, its Interactive Voice Response (IVR) feature gives users an access to relevant information by using their voice. This means they do not have to mind their grammar or spelling!</p>", "<p>It informs you of the services and other freelancers that are near your current location. This should help you in carrying out tasks immediately without having to look somewhere else. For your safety, it also informs you of local emergency numbers like the ambulance and the police contacts.</p>", "<p>If you don’t want to regret buying a house of a property that cost you a large amount of money, you can seek the help of ZipMatch in this matter. It is an online real estate marketplace that aims to empower buyers by providing them relevant information about their potential properties and by also assisting them in the transactions that they still have to go through. ZipMatch was the result of the combined ideas of entrepreneur John Dang and real estate broker Chow Paredes, who both recognize that difficulties that home buyers here in the Philippines face.</p>", "<p>Radiologists are hard to find despite the critical role that they play in medical processes. For the record, radiologists are those experts in photo documenting and interpreting the internal parts of a person’s body, allowing both the patient and his/her doctor to see what is (wrong) inside of him/her. Lifetrack Medical Systems connects patients to experienced radiologists to help them assess medical images and immediately report to other doctors if necessary.</p>", "<p><em>Order Now. We Deliver. </em>That is the tag line of HomeDiner. It helps you in ordering food from different restaurants. It also helps your orders be delivered at your current location, especially if you just want to enjoy the view of your place. Furthermore, HomeDiner allows you to cancel orders if you suddenly have a change of mind (or heart).</p>", "<p>Do you have a memorable (or embarrassing) moment that you want to share? Then, there is a platform that allows you to document such moments. Introducing Tripsiders. Launched five years ago, Tripsiders has now built a community of travelers who share their experiences with the others. Here, you can get inspired by other people’s stories or be informed by reading travel tips and insider information about the places you want to go to.</p>", "<p>You and your friends have that moment when you really don’t know what and where to eat.</p>", "<p>Fortunately, there’s FoodEagle available for you all. It has an image section that shows you photos of food that will make you crave. It also tells you of the restaurants nearby. You won’t go hungry with FoodEagle!</p>", "<p>Galleon.ph presents products outside the Philippines, giving you a different shopping experience. Paying will not be a problem because it gives different paying options. Rest assured that the amount you will pay for includes everything, from the price of the product to the shipping fee.</p>", "<p>DragonPay is an alternative paying gateway built for people in developing countries. It allows customers to buy online and pay via automated teller machines (ATMs) and online banking services. You can also pay directly at banks or at the retailers themselves.</p>", "<p>Lifebit is an online diary—best for people who like to share their lives with the others. However, this is different from blogs or other social networking sites like Facebook, Twitter, and Tumblr. It is actually a game! You will get badges for every moment of your life that you post, making your Lifebit experience more fun and exciting!</p>", "<p>AVA is an online marketplace featuring the brands that you surely love! It has La Mer watches, wallets from Dynomighty, jewelry from Natalya Lagdameo, foldable sunglasses from Sunpocket, and hand-crafted jewelry from Panopio. Do you want more? What about gift items from Balvi, office supplies from Lexon, shoes from Bensimon, jeans from Monkee Genes, and exclusive AVA brands Janus and Pollock. It also offers sales so you can buy their products at cheaper prices! You just have to be quick because these sales only run for a few days.</p>", "<p>Technology has been booming in the recent years and GSMetrix is taking advantage. This startup focuses on research and development in the context of engineering. It has already supported public and private sectors in developing technologies on weather monitoring, fleet management, and data acquisition. Validating their claim as one of the best in the industry are their Technology Company of the Year award in 2010, Best Technology Award (by Global TIC in Taiwan), and its nomination to the Asian Innovation Awards in 2011.</p>", "<p>Salarium is another SAAS aimed to serve both small-time and large-scale businesses. Its main service is providing payroll systems, keeping in track time and attendance of employees, salary disbursement, and tax calculations.</p>", "<p>Salarium-based payroll systems are easy to use. You do not need to be hardcore cloud experts. They are also customizable and can adapt to other similar softwares, making data importation and exportation easier.</p>", "<p>Furthermore, the security of those payroll systems are follows Philippine, US, and European Union standards. You’re now sure that your data will not be easily stolen by online thieves!</p>", "<p>program by referring you to its partner call centers; reimbursing your transportation expenses; and allowing you to <em>“study now [then] pay later!”</em></p>", "<p>This is a research assistance tool that helps you understand legal concepts easily. Because it is cloud-based, you can access all of its features using any device. It also provides you customizable legal and business forms so you don’t have to worry on formatting letters anymore.</p>", "<p>Pouch is promoting smart wristbands in place of tickets in order to enter big events. These wristbands do not just act like tickets to enter an event; they can also be used to pay for your food, drinks, and merchandizes! It goes to show that Pouch really wants you to experience memorable and hassle-free moments!</p>", "<p>It offers customer service and back-office support to companies looking for outsourcing providers that cover a global scale. Its back-office support services include content moderation, audio and video transcription, data input and analytics, and online research. Meanwhile, its customer services include upselling programs, welcome calls, omnichannel support, and inbound and outbound support.</p>", "<p>As its name suggests, LoanSolutions aims to address the lending industry in the country by providing the best lending rates available. So far, you can apply for a personal, OFW, vehicle, and business loans. You are sure that you will really have your loans because LoanSolutions supported by BDO, Metrobank, and Sterling Bank of Asia, to name a few. In general, it wants to empower people in order for them to make better financial decisions in life!</p>", "<p>meanwhile, allows your team to update your target customers of your latest products and services despite having no internet connection. This implies that your business can widen its reach and improve its rapport with other people.</p>", "<p>As a business head or manager, you have to if your employees are getting their jobs done. With Tarkie, you will be able to track all your employees at once without having to wish to divide your body! You will also be able to monitor their progress in their assignments so you don’t need to wait for them to report. Furthermore, you will quickly know who’s leading and who’s getting behind, notifying you if you need to intervene already or just let the employee handle the job by herself/himself. In other words, Tarkie will help you in ensuring efficiency and productivity in your workplace!</p>", "<p>middle and lower classes to be literate in relatively complicated financial transactions, helping them in improving their lives eventually. Specifically, the services of Ayannah are mobile- and social media- based, veering away from the processes of traditional banks.</p>", "<p>Galileo creates the smartphone app, PARAK—a police accident report kit. You do not need to wait for the police or the media to report an accident because the PARAK app can be used as a platform for such reports. In fact, the Land Transportation Franchising and Regulatory Board had already plans to use Galileo Software’s app to aid the Highway Patrol Group in their every day duties.</p>", "<p> </p>"]}
]